Documents/РасходыНаМобильнуюСвязь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РасходыНаМобильнуюСвязь</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасходыНаМобильнуюСвязь</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АК_ОператорыМобильнойСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СимКарта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбонентскаяПлата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МобильнаяСвязь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SMSMMS</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Интернет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роуминг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеУслуги</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНеЗарегистрирован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходыНаМобильнуюСвязь/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Оператор",Объект.Оператор);
	Результат = ОткрытьФормуМодально("Обработка.ЗакрузкаРасходовНаМобильнуюСвязь.Форма.Форма",ПараметрыОткрытия);
	ЗагрузитьРезультат(Результат);
	
	
КонецПроцедуры

Процедура ЗагрузитьРезультат(Результат);
	
	Если Результат <> Неопределено Тогда	
		ТаблицаРасходы = ПолучитьИзВременногоХранилища(Результат.Адрес);	
		Объект.Расходы.Загрузить(ТаблицаРасходы);
		Объект.Комментарий = "Загружено из файла: " + Результат.Файл;
		 ПересчитатьИтогоВрасходах();
		
	КонецЕсли;
	
	
	ОбновитьДанныеПодвала();
	
КонецПроцедуры

Процедура ПересчитатьИтогоВрасходах()
	
	Для каждого Строка из объект.Расходы Цикл 
			
		ПересчитатьИтогоВСтроке(Строка);
			
	КонецЦикла;		
	
	
КонецПроцедуры

Процедура ПересчитатьИтогоВСтроке(ТекущаяСтрока)
	
	ТекущаяСтрока.Итого =   ТекущаяСтрока.МобильнаяСвязь + 
							ТекущаяСтрока.АбонентскаяПлата +
							ТекущаяСтрока.SMSMMS +
							ТекущаяСтрока.Интернет +
							ТекущаяСтрока.Роуминг +
							ТекущаяСтрока.ДополнительныеУслуги -
							ТекущаяСтрока.Скидка;
	
КонецПроцедуры	
						

&НаКлиенте
Процедура ПересчитатьИтогоВСтрокеНаКлиенте(ТекущаяСтрока)
	
	ТекущаяСтрока.Итого =   ТекущаяСтрока.МобильнаяСвязь + 
							ТекущаяСтрока.АбонентскаяПлата +
							ТекущаяСтрока.SMSMMS +
							ТекущаяСтрока.Интернет +
							ТекущаяСтрока.Роуминг +
							ТекущаяСтрока.ДополнительныеУслуги -
							ТекущаяСтрока.Скидка;
	
КонецПроцедуры	
						

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расходы.ТекущиеДанные;
	ПересчитатьИтогоВСтрокеНаКлиенте(ТекущаяСтрока);						
	ОбновитьДанныеПодвала();						
	
КонецПроцедуры

Процедура ОбновитьДанныеПодвала()
	
	Расходы = объект.Расходы.Выгрузить();
	ИтогоСимКарт = Расходы.Количество();
	ИтогоАбонентскаяПлата = Расходы.Итог("АбонентскаяПлата");
	ИтогоМобильнаяСвязь = Расходы.Итог("МобильнаяСвязь");
	ИтогоSMSMMS = Расходы.Итог("SMSMMS");
	ИтогоИнтернет = Расходы.Итог("Интернет");
	ИтогоРоуминг = Расходы.Итог("Роуминг");
	ИтогоДополнительныеУслуги = Расходы.Итог("ДополнительныеУслуги");
	ИтогоСкидка = Расходы.Итог("Скидка");
	Итого = ИтогоАбонентскаяПлата+
			ИтогоМобильнаяСвязь +
			ИтогоSMSMMS +
			ИтогоИнтернет +
			ИтогоРоуминг +
			ИтогоДополнительныеУслуги -
			ИтогоСкидка;
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+++АК sils 08.06.2018 ИП-00018876
	ОперацияАпдекс = APDEX_ОценкаПроизводительностиКлиентСервер.ПолучитьОперацию("Открытие документа Расходы на мобильную связь");
	APDEX_ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(ОперацияАпдекс);
	//---АК
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Объект.ДатаОкончания = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
	
	ПересчитатьИтогоВрасходах();
	ОбновитьДанныеПодвала();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		Отказ= Истина;
		Сообщить("Дата начала не можыть быть позже даты окончания");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.ДатаНачала = НачалоМесяца(Объект.Дата);
	Объект.ДатаОкончания = КонецМесяца(Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ОператорПриИзмененииНаСервере()
	Объект.ВариантРасчетаНДС = Объект.Оператор.ВариантРасчетаНДС;
КонецПроцедуры

&НаКлиенте
Процедура ОператорПриИзменении(Элемент)
	ОператорПриИзмененииНаСервере();
КонецПроцедуры

//+++АК sils 08.06.2018 ИП-00018876
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	APDEX_ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(ОперацияАпдекс, ?(Параметры.Ключ.Пустая(), "Новый документ", "" + Объект.Ссылка));
КонецПроцедуры
